; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-4-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-3 - location
	p1-4 - location
	p1-5 - location
	p2-0 - location
	p3-0 - location
	p3-5 - location
	p4-0 - location
	p4-1 - location
	p5-0 - location
	p5-2 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s3)
	(at driver3 s3)
	(at driver4 s5)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at package1 s4)
	(at package2 s0)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(link s0 s4)
	(link s4 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s4)
	(link s4 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s5)
	(at driver4 s4)
	(at truck1 s2)
	(at truck2 s3)
	(at truck3 s4)
	(at truck4 s1)
	(at package1 s3)
	(at package2 s0)
	))


)

; plan
1. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   goals met: 3 of 9
2. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   goals met: 3 of 9
3. (walk driver4 s1 p1-4)
   deleted: (at driver4 s1)
   added: (at driver4 p1-4)
   goals met: 3 of 9
4. (walk driver4 p1-4 s4)
   deleted: (at driver4 p1-4)
   added: (at driver4 s4)
   goals met: 4 of 9
5. (walk driver3 s3 p3-0)
   deleted: (at driver3 s3)
   added: (at driver3 p3-0)
   goals met: 4 of 9
6. (walk driver3 p3-0 s0)
   deleted: (at driver3 p3-0)
   added: (at driver3 s0)
   goals met: 4 of 9
7. (walk driver2 s3 p3-5)
   deleted: (at driver2 s3)
   added: (at driver2 p3-5)
   goals met: 4 of 9
8. (walk driver2 p3-5 s5)
   deleted: (at driver2 p3-5)
   added: (at driver2 s5)
   goals met: 5 of 9
9. (walk driver1 s5 p1-5)
   deleted: (at driver1 s5)
   added: (at driver1 p1-5)
   goals met: 5 of 9
10. (walk driver1 p1-5 s1)
   deleted: (at driver1 p1-5)
   added: (at driver1 s1)
   goals met: 5 of 9
11. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   goals met: 5 of 9
12. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   goals met: 6 of 9
13. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 9
14. (drive-truck truck2 s0 s4 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 6 of 9
15. (load-truck package1 truck2 s4)
   deleted: (at package1 s4)
   added: (in package1 truck2)
   goals met: 6 of 9
16. (drive-truck truck2 s4 s3 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 7 of 9
17. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 9
18. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 7 of 9
19. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 7 of 9
20. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 8 of 9
21. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   goals met: 8 of 9
22. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   goals met: 8 of 9
23. (walk driver1 s0 p4-0)
   deleted: (at driver1 s0)
   added: (at driver1 p4-0)
   goals met: 8 of 9
24. (walk driver1 p4-0 s4)
   deleted: (at driver1 p4-0)
   added: (at driver1 s4)
   goals met: 9 of 9
